Revit 2027 API
AssetPropertyDoubleArray4d.GetValueAsColor Method
 Gets the value property as a color.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color GetValueAsColor()
Public Function GetValueAsColor As Color
public:
Color^ GetValueAsColor()
member GetValueAsColor : unit -> Color
Return Value
Color
 The color value.
See Also
Reference
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace